# Задания по работе с текстом
1. [Задание 1](#задание-1)
2. [Задание 2](#задание-2)
3. [Задание 3](#задание-3)
4. [Задание 4](#задание-4)
5. [Задание 5](#задание-5)
6. [Использование метода-цепочки](#использование-метода-цепочки)

## Задание 1
Чтение и обработка текстового файла с числовой информацией. Дан текстовый файл с числовой информацией (каждое число на новой строке). Напишите программу для чтения файла, вычисления суммы чисел и определения среднего значения.
### Готовое решение 1
```
# Открываем файл для чтения
with open('numbers.txt', 'r') as file:
    # Читаем числа из файла и вычисляем сумму и среднее
    numbers = [int(line) for line in file.readlines()]
    sum_numbers = sum(numbers)
    average = sum_numbers / len(numbers)

# Выводим результат
print(f"Сумма чисел: {sum_numbers}")
print(f"Среднее значение: {average}")
```

## Задание 2
Чтение и обработка файла с текстовой информацией. 
Дан текстовый файл с предложениями. Напишите программу для чтения файла, определения количества слов в каждом предложении и вывода предложения с наибольшим числом слов.
### Готовое решение 2
```
# Открываем файл для чтения
with open('sentences.txt', 'r') as file:
    # Читаем предложения из файла
    sentences = file.readlines()

# Находим предложение с наибольшим числом слов
max_words_sentence = max(sentences, key=lambda sentence: len(sentence.split()))

# Выводим результат
print(f"Предложение с наибольшим числом слов: {max_words_sentence}")
```
### Решение 2
Поскольку в условиях задания не указано как расположены предложения по строкам, то предполагаем, что произвольно.
```
import re


# Читаем текст из файла
path = '/home/andrallex/python-ed/intensive_course/1_working_with_text_files/text_for_task_2.txt'
in_file = open(path, 'r', encoding = 'utf-8')
in_text = in_file.read()
in_file.close()

# Любые законченные предложения оканчиваются следующими знаками препинания: "."("..."), "?", "!"
sentences = re.split(r'[.!?]+', in_text)
split_sentences = [sent.strip().split() for sent in sentences if sent.strip().split()]
split_sentences.sort(key=len)
sentence_and_number_maps = [{" ".join(sent): len(sent)} for sent in split_sentences]
max_len_sentence = " ".join(split_sentences[-1])

print(f'Исходный текст из файла: {in_text}')
print(f'Исходные предложения: {sentences}')
print(f'Предложения разбитые по словам: {split_sentences}')
print(f'Предложения с указанием количества слов: {sentence_and_number_maps}')
print(f'Предложение с наибольшим количеством слов: {max_len_sentence}')
```
### Результат 2
```
Исходный текст из файла: Взошло яркое солнце! Набежали серые низкие тучи.
   Темнеет... Уже вечер? 
Исходные предложения: ['Взошло яркое солнце', ' Набежали серые низкие тучи', '\n   Темнеет', ' Уже вечер', ' ']
Предложения разбитые по словам: [['Темнеет'], ['Уже', 'вечер'], ['Взошло', 'яркое', 'солнце'], ['Набежали', 'серые', 'низкие', 'тучи']]
Предложения с указанием количества слов: [{'Темнеет': 1}, {'Уже вечер': 2}, {'Взошло яркое солнце': 3}, {'Набежали серые низкие тучи': 4}]
Предложение с наибольшим количеством слов: Набежали серые низкие тучи
```
## Задание 3
Запись нового файла. Пользователь вводит строки текста. 
Напишите программу для записи в новый текстовый файл этих строк.

### Готовое решение 3
```
# Открываем файл для записи
with open('new_file.txt', 'w') as file:
    # Пользователь вводит строки текста
    while True:
        user_input = input("Введите строку текста (или введите 'exit' для завершения): ")
        if user_input.lower() == 'exit':
            break
        file.write(user_input + '\n')
```
## Задание 4
Добавление информации в файл. Дан существующий текстовый файл. Пользователь вводит новую строку текста. 
Напишите программу для добавления в конец файла введенной пользователем строки.
### Готовое решение 4
```
# Открываем файл для добавления информации
with open('existing_file.txt', 'a') as file:
    # Пользователь вводит новую строку текста
    user_input = input("Введите новую строку текста: ")
    # Добавляем введенную строку в конец файла
    file.write(user_input + '\n')
```
### Решение 4
```
# Читаем введенную строку текста
input_string = input('Введите новую строку текста: ')

# Записываем введенную строку в конец файла
path_to_file = '/home/andrallex/python-ed/intensive_course/1_working_with_text_files/text_for_task_4.txt'
with open(path_to_file, 'a', encoding = 'utf-8') as file:
    file.write(f'\n {input_string}')
    
# Проверяем
with open(path_to_file, 'r', encoding = 'utf-8') as file:
    lines = [line for line in file.readlines()]
    print(f'Первая строка исходного текста: {lines[0]}')
    print(f'Последняя добавленная пользователем строка: {lines[-1]}')
```
### Результат 4
```
Введите новую строку текста: Ночь темна
Первая строка исходного текста: Взошло яркое солнце! Набежали серые низкие тучи.

Последняя добавленная пользователем строка:  Ночь темна
```

## Задание 5
Запись в середину файла с сохранением старого контента. Дан текстовый файл. Пользователь вводит новую строку текста. 
Напишите программу для добавления в середину файла введенной пользователем строки, сохраняя при этом старое содержимое файла.

### Готовое решение 5
```
# Открываем файл для чтения и записи
with open('file_to_update.txt', 'r+') as file:
    # Читаем содержимое файла
    content = file.read()

    # Пользователь вводит новую строку текста
    new_line = input("Введите новую строку текста для добавления в середину файла: ")

    # Находим индекс середины файла
    middle_index = len(content) // 2

    # Перемещаем указатель в середину файла
    file.seek(middle_index)

    # Добавляем новую строку
    file.write(new_line)

    # Добавляем обратно старое содержимое, начиная с позиции вставки
    file.write(content[middle_index:])
```

## Использование метода-цепочки
```
text='''Простите, верные дубравы!
    Прости, беспечный мир полей,
    И легкокрылые забавы
    Столь быстро улетевших дней!'''
result = text.strip().lower().replace(" ", "_")
print(result)
```
```
# подсчет слов

from collections import Counter

text='''Простите, верные дубравы!
    Прости, беспечный мир полей,
    И легкокрылые забавы
    Столь быстро улетевших дней!'''
words = text.split()
counts = Counter(words)
for word, count in counts.items():
    print(f"{word}: {count}")
print("Самые встречаемые слова:",
counts.most_common(5))
```





