# Практическое занятие 1. Базовые конструкции в Python
1. [Задание 1](#задание-1)
2. [Задание 2](#задание-2)
3. [Задание 3](#задание-3)
4. [Задание 4](#задание-4)

## Описание вспомогательных функций
```
# Сохраняет в кортеж введенную пользователем пару: Дата задачи - Описание задачи 
def input_to_do_item() -> tuple:
    task_data = input('Введите дату в формате чч.мм.гггг: ')
    task_description = input('Введите описание задачи: ')
    return (task_data, task_description)

# Выводит на печать переданный список дел в подходящем формате    
def print_to_do_list(to_do_list: list):
    for item in to_do_list:
        task_data, task_description = item
        print(f'{task_data} {task_description}')
    
```
### Задание 1
Напишите программу, которая последовательно запрашивает у пользователя Дату и Описание задачи, а затем выводит их через пробел.
```
# Задание 1
task_data, task_description = input_to_do_item()
print(f'{task_data} {task_description}')
```
### Задание 2
Модифицируйте программу из задания 1 таким образом, чтобы запрос даты и задачи выполнялся трижды и после этого результаты выводились на экран построчно в формате: на одной строчке дата и задача через пробел.
```
# Задание 2
def input_to_do_list():
    to_do_list = list()
    for i in range(3):
        to_do_list.append(input_to_do_item())
    print_to_do_list(to_do_list)

input_to_do_list()

# Вывод
Введите дату в формате чч.мм.гггг: 01.02.2025
Введите описание задачи: To do task 1
Введите дату в формате чч.мм.гггг: 02.02.2025
Введите описание задачи: To do task 2
Введите дату в формате чч.мм.гггг: 03.02.2025
Введите описание задачи: To do task 3

01.02.2025 To do task 1
02.02.2025 To do task 2
03.02.2025 To do task 3
```
### Задание 3
Модифицируйте программу из задания 2 таким образом, чтобы данные не выводились на экран, а сохранялись в словарь. Ключами в этом словаре должны быть даты, а значениями – соответствующие им задачи.
```
# Задание 3
def input_to_do_to_dict():
    to_do_dict = {}
    for i in range(3):
        data, task_description = input_to_do_item()
        to_do_dict[data] = task_description
    return to_do_dict

print(input_to_do_to_dict())

# Вывод
Введите дату в формате чч.мм.гггг: 01.02.2025
Введите описание задачи: To do task 1
Введите дату в формате чч.мм.гггг: 02.02.2025
Введите описание задачи: To do task 2
Введите дату в формате чч.мм.гггг: 03.02.2025
Введите описание задачи: To do task 3
{'01.02.2025': 'To do task 1', '02.02.2025': 'To do task 2', '03.02.2025': 'To do task 3'}
```
### Задание 4
Запрашивать у пользователя команду. В зависимости от введенной команды выполнять действие.
Команды:
`help` – напечатать справку по программе;
`add` – добавить задачу в список (название задачи запрашиваем у пользователя);
`print` – напечатать все добавленные задачи.
```
# Задание 4
def select_action_by_command():
    to_do_list = list()
    type_action = input("Введите одну команду из списка: 'help', 'add', 'print': ")

    while type_action not in ['add', 'help', 'print']:
        print("Команда введена неверно, попробуйте еще раз!")
        type_action = input("Введите команду из списка: 'help', 'add', 'print': ")

    while type_action == 'add':
        to_do_list.append(input_to_do_item())
        type_action = input("Введите команду из списка: 'help', 'add', 'print': ")

    if type_action == 'print':
        if to_do_list:
            print_to_do_list(to_do_list)
        else:
            print("Список задач пустой")
    elif type_action == 'help':
        print("Это справка по программе")

# Вывод
Введите одну команду из списка: 'help', 'add', 'print': add
Введите дату в формате чч.мм.гггг: 01.02.2025
Введите описание задачи: To do task 1
Введите команду из списка: 'help', 'add', 'print': add
Введите дату в формате чч.мм.гггг: 02.02.2025
Введите описание задачи: To do task 2
Введите команду из списка: 'help', 'add', 'print': print
01.02.2025 To do task 1
02.02.2025 To do task 2

```
