# Задания по работе с текстом
1. [Задание 1]()
2. [Задание 2](#задание-2)
3. [Задание 3]()
4. [Задание 4]()
5. [Задание 5]()

## Задание 2
Чтение и обработка файла с текстовой информацией. 
Дан текстовый файл с предложениями. Напишите программу для чтения файла, определения количества слов в каждом предложении и вывода предложения с наибольшим числом слов.

### Решение 2
Поскольку в условиях задания не указано как расположены предложения по строкам, то предполагаем, что произвольно.
```
import re


# Читаем текст из файла
path = '/home/andrallex/python-ed/intensive_course/1_working_with_text_files/text_for_task_2.txt'
in_file = open(path, 'r', encoding = 'utf-8')
in_text = in_file.read()
in_file.close()

# Любые законченные предложения оканчиваются следующими знаками препинания: "."("..."), "?", "!"
sentences = re.split(r'[.!?]+', in_text)
split_sentences = [sent.strip().split() for sent in sentences if sent.strip().split()]
split_sentences.sort(key=len)
sentence_and_number_maps = [{" ".join(sent): len(sent)} for sent in split_sentences]
max_len_sentence = split_sentences[-1]

print(f'Исходный текст из файла: {in_text}')
print(f'Исходные предложения: {sentences}')
print(f'Предложения разбитые по словам: {split_sentences}')
print(f'Предложения с указанием количества слов: {sentence_and_number_maps}')
print(f'Преложение с наибольшим количество слов: {max_len_sentence}')
```
### Результат 2
```
Исходный текст из файла: Взошло яркое солнце! Набежали серые низкие тучи.
   Темнеет... Уже вечер? 
Исходные предложения: ['Взошло яркое солнце', ' Набежали серые низкие тучи', '\n   Темнеет', ' Уже вечер', ' ']
Предложения разбитые по словам: [['Темнеет'], ['Уже', 'вечер'], ['Взошло', 'яркое', 'солнце'], ['Набежали', 'серые', 'низкие', 'тучи']]
Предложения с указанием количества слов: [{'Темнеет': 1}, {'Уже вечер': 2}, {'Взошло яркое солнце': 3}, {'Набежали серые низкие тучи': 4}]
Преложение с наибольшим количество слов: ['Набежали', 'серые', 'низкие', 'тучи']
```

