# Практическое занятие 8.1 Использование лямбда функций для решения задач. Задания и решения задач.
1. []()
2. []()
3. []()
4. []()
5. []()
6. []()
7. []()

## Задание 1.
 - а) Напишите лямбда-функцию, которая добавляет 15 к заданному числу, переданному в качестве аргумента, а также лямбда-функцию, которая умножает аргумент x на аргумент y, и выведите результат. 
    - *Решение а)*
```
add_15 = lambda x: x + 15
print(add_15(5))

# Result:
20
```
```
multiply_x_by_y = lambda x, y: x*y
print(multiply_x_by_y(5, 4))

# Result:
20
```
 - б) Найти максимальное и минимальное значения в заданном списке кортежей с помощью лямбда-функции. 
    - *Решение б)*
```
# через списковое включение
list_of_tuples = [(i, i + 1) for i in range(10)]
print(list_of_tuples)

min_in_tuples = [lambda x = x: min(x) for x in list_of_tuples]
min_in_list = min([lmb() for lmb in min_in_tuples])
print(min_in_list)
    
# Result:
[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 6), (6, 7), (7, 8), (8, 9), (9, 10)]
0
# --------------------------------------------------------------------------------
max_in_tuples = [lambda x = x: max(x) for x in list_of_tuples]
max_in_list = max([lmb() for lmb in max_in_tuples])
print(max_in_list)
    
# Result:
[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 6), (6, 7), (7, 8), (8, 9), (9, 10)]
10
```
```
# с помощью функции reduce()
from functools import reduce

list_of_tuples = [(i, i + 1) for i in range(10)]
print(list_of_tuples)

min_val = min(reduce((lambda x, y: min(x, y)), list_of_tuples))
print(f'min_val: {min_val}')

max_val = min(reduce((lambda x, y: max(x, y)), list_of_tuples))
print(f'max_val: {max_val}')

# Result:
[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5), (5, 6), (6, 7), (7, 8), (8, 9), (9, 10)]
min_val: 0
max_val: 9
```
 - в) Извлечь строки с заданной длиной из списка строковых значений с помощью лямбда-функции.
    - *Решение в)*
```
# с использованием функции filter()
list_of_strings = ['a', 'a',
                   'bb', 'bb',
                   'ccc', 'ccc']
fix_len = 2
list_of_strings_of_eq_len = list(filter(lambda x: (len(x) == fix_len), list_of_strings))
print(list_of_strings_of_eq_len)

# Result:
['bb', 'bb']
```

 ## Задание 2.
 - а) Напишите лямбда-функцию, которая принимает один аргумент, и этот аргумент должен быть умножен на неизвестное заданное число.
  
 - б) Найти числа, делящиеся на девятнадцать или тринадцать, из списка чисел, используя лямбда-функцию. 
 - в) Напишите программу для подсчёта вещественных чисел в заданном смешан- ном списке с помощью лямбда-функции.

 ## Задание 3. 
 - а) Используя лямбда-функцию, отсортировать список кортежей. Пример: [('English', 88), ('Science', 90), ('Maths', 97), ('Social sciences', 82)] →[('Social sciences', 82), ('English', 88), ('Science', 90), ('Maths', 97)]. 
 - б) Найдите палиндромы в заданном списке строк с помощью лямбда- функции. 
 - в) Найти индекс и значение максимального и минимального значенийв заданном списке чисел.

 ## Задание 4.
 - a) Используя лямбда-функцию, отсортировать список словарей. Пример: [{'make': 'Nokia', 'model': 216, 'color': 'Black'}, {'make': 'Mi Max', 'model': '2', 'color': 'Gold'}, {'make': 'Samsung', 'model': 7, 'color': 'Blue'}] → [{'make': 'Nokia', 'model': 216, 'color': 'Black'}, {'make': 'Samsung', 'model': 7, 'color': 'Blue'}, {'make': 'Mi Max', 'model': '2', 'color': 'Gold'}]. 
 - б) Найти все анаграммы в заданном списке строк с помощью лямбда- функции. Пример: 'abcd', ['bcda', 'abce', 'cbda', 'cbea', 'adcb'] → ['bcda', 'cbda', 'adcb']. 
 - в) Напишите программу для сортировки заданного смешанного списка целых чисел и строк с помощью лямбда-функции. Числа должны быть отсортированы перед строками. Пример: [19, 'red', 12, 'green', 'blue', 10, 'white', 'green', 1] → [1, 10, 12, 19, 'blue', 'green', 'green', 'red', 'white'].

 ## Задание 5.
 - а) Отфильтровать список целых чисел на чётные и нечётные числа с помощью лямбда-функции. 
 - б) Для удаления определённых слов из заданного списка используйте лямбда-функцию. Пример: дан список слов ['orange', 'red', 'green', 'blue', 'white', 'black'], удалить слова ['orange', 'black'] → ['red', 'green', 'blue', 'white']. 
 - в) Используя лямбда-функцию, проверить, отсортирован ли указанный список или нет.


